Autodesk.Revit.DB.ClassificationEntry.#ctor(System.String,System.String,System.String,System.Int32,Autodesk.Revit.DB.ElementId)
Constructs a ClassificationEntry object
key:
The key of this ClassificationEntry.
parentKey:
The parent key of this ClassificationEntry.
description:
The description associated with this ClassificationEntry.
level:
The level of this ClassficationEntry.
categoryId:
The category id of this ClassificationEntry.
The category can be invalidElementId, otherwise it must represent Revit existing category.
Throws Autodesk.Revit.Exceptions.ArgumentException:
key is an empty string.
-or-
The categoryId is not appropriate category id for classfication entry.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015